propeller/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.03339;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.03339;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    top
    {
        type            slip;
    }
    
    bottom
    {
        type            slip;
    }
    
    front
    {
        type            slip;
    }
    
    back
    {
        type            slip;
    }

     // -- Sólidos -------------------------------------------------------
    
    propeller
    {
        type            kqRWallFunction;
        value           uniform 0.03339;
    }

    cylinder
    {
        type            zeroGradient;
    }

    cylinder_slave
    {
        type            zeroGradient;
    }


    // -- Interfaz NCC: patches de pared simple ------------------------
    // zeroGradient en la interfaz de deslizamiento libre
    
    rotatingZoneInner
    {
        type            zeroGradient;
    }

    rotatingZoneOuter
    {
        type            zeroGradient;
    }

    // -- Patches nonConformalCyclic -----------------------------------

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
