propeller/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    
    top
    {
        type            slip;
    }
    
    bottom
    {
        type            slip;
    }
    
    front
    {
        type            slip;
    }
    
    back
    {
        type            slip;
    }

    // -- Sólidos -------------------------------------------------------
    
    propeller
    {
        type            nutkWallFunction;
    	value           uniform 0;
    }

    cylinder
    {
        type            calculated;
        value           uniform 0;
    }

    cylinder_slave
    {
        type            calculated;
        value           uniform 0;
    }

    // -- Interfaz NCC: patches de pared simple -------------------------
    
    rotatingZoneInner
    {
        type            calculated;
        value           uniform 0;
    }

    rotatingZoneOuter
    {
        type            calculated;
        value           uniform 0;
    }

    // -- Patches nonConformalCyclic ------------------------------------

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
