propeller/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.167;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.167;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    top
    {
        type            slip;
    }
    
    bottom
    {
        type            slip;
    }
    
    front
    {
        type            slip;
    }
    
    back
    {
        type            slip;
    }

    // -- Sólidos -------------------------------------------------------
    
    propeller
    {
        type            omegaWallFunction;
        value           uniform 0.167;
    }

    cylinder
    {
        type            zeroGradient;
    }

    cylinder_slave
    {
        type            zeroGradient;
    }

    // -- Interfaz NCC: patches de pared simple -------------------------
    
    rotatingZoneInner
    {
        type            zeroGradient;
    }

    rotatingZoneOuter
    {
        type            zeroGradient;
    }

    // -- Patches nonConformalCyclic (creados por createNonConformalCouples) --

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
