propeller/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type			motionSolver;
    
    libs			("libfvMotionSolvers.so");
    
    motionSolver		solidBody;
    
    cellZone			rotatingZone;

    solidBodyMotionFunction	rotatingMotion;

    origin			(0 0 0);
    axis			(1 0 0);

    omega			70.8 [rpm];
}

// ************************************************************************* //
