propeller/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-30 -15  -15)   // 0
    ( 12 -15  -15)   // 1
    ( 12  15  -15)   // 2
    (-30  15  -15)   // 3

    (-30 -15   15)   // 4
    ( 12 -15   15)   // 5
    ( 12  15   15)   // 6
    (-30  15   15)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (168 60 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    outlet
    {
        type patch;
        faces
        (
	 (0 3 7 4)
        );
    }

    front
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }
    back
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }

    top
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
);

mergePatchPairs ();

// ************************************************************************* //
