propeller/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         8.47;

deltaT          0.0005;

adjustTimeStep  no;

//maxCo           0.5;
//maxDeltaT       0.001;

writeControl    adjustableRunTime;

writeInterval   0.105875;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// =====================================================================

// FUNCIONES DE POST-PROCESAMIENTO
// =====================================================================

functions
{
    forcesPropeller
    {
        type            forces;
        libs            ("libforces.so");
	
        patches         (propeller);
        rho             rhoInf;
        rhoInf          1025;
        log             yes;
	
        writeControl    adjustableRunTime;
	writeInterval   0.105875;
        CofR            (0 0 -0.5);
    }

    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");
	
        patches         (propeller);
        rho             rhoInf;
        rhoInf          1025;
        log             yes;

	writeControl    adjustableRunTime;
	writeInterval   0.105875;
	
        liftDir         (0 0 1);        
        dragDir         (1 0 0);        
        pitchAxis       (0 1 0);
	
        magUInf         7.46;          	
        lRef            0.86;        // diámetro de la hélice 
        Aref            61.67;        // pi*R^2	 
        CofR            (0 0 -0.5);
    }

// Monitorear residuales
    residuals
    {
        type            residuals;
        libs            ("libutilityFunctionObjects.so");

	writeControl    adjustableRunTime;
	writeInterval   0.105875;
	
        fields          (U p k omega);

	log             yes;
    }

// =====================================================================
// CAMPO y+
// =====================================================================

   yplus
   {
       type		yPlus;
       libs		("libfieldFunctionObjects.so");

       writeControl	writeTime;

       log              yes;
   }

// =====================================================================
// CALCULO DE VORTICIDAD
// =====================================================================

   vorticity
   {
       type		vorticity;
       libs		("libfieldFunctionObjects.so");

       writeControl	writeTime;

       log              yes;
   }

// =====================================================================
// CRITERIO Q
// =====================================================================

   Q
   {
       type		Q;
       libs		("libfieldFunctionObjects.so");

       writeControl	writeTime;

       log              yes;
   }
}

// ************************************************************************* //
