propeller/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly  true;

baffles
{
    NCCInterface
    {
	type		faceZone;
	zoneName	NCCInterface;

	patches
    	{
	    owner
	    {
		name	rotatingZoneOuter;
		type 	wall;
	    }

	    neighbour
	    {
		name	rotatingZoneInner;
		type	wall;
	    }
        }
    }       
}

// ************************************************************************* //
