propeller/system/createNonConformalCouplesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      createNonConformalCouplesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nonConformalCouples
{
    rotatingInterface
    {
        // El lado rotante suele quedar más fino por el refinamiento de la hélice.
        // Se pone como neighbour para reducir la projected volume fraction.
        owner
	{
	    patch rotatingZoneOuter;
	}

        
        neighbour
	{
	    patch rotatingZoneInner;
	}

        transformType		rotational;
        rotationAxis	(1 0 0);
        rotationCentre	(0 0 0);
	rotationAngle   0;
    }
}

// ************************************************************************ //
