propeller/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                  GAMG;
        tolerance               1e-06;
        relTol                  0.1;
        smoother                GaussSeidel;
	cacheAgglomeration      true;
	nCellsInCoarsestLevel   20;
	agglomerator            faceAreaPair;
	mergeLevels             1;
    }

    pcorr
    {
        $p;
	tolerance       1e-06;
    }

    pFinal
    {
	$p;
	relTol	0;
    }

    MeshPhi
    {
        solver          PCG;
        tolerance       1e-06;
        relTol          0;
        preconditioner  DIC;
    }

    MeshPhiFinal
    {
	$MeshPhi;
	relTol	0;
    }

    "(U|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(UFinal|kFinal|omegaFinal)"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
     nOuterCorrectors            3;
     nCorrectors                 2;
     nNonOrthogonalCorrectors    1;

     correctMeshPhi              yes;

     pRefPoint                   (10 10 -10);
     pRefValue                   0;
}

relaxationFactors
{
    fields
    {
        p               0.3;  // Relajación fuerte = estabilidad
    }
    equations
    {
        U               0.5;  // Relajación moderada
        "(k|omega)"     0.5;
    }
}


// ************************************************************************* //
